#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.iam-role-for-lambda.aws_iam_role.this: Refreshing state... [id=LambdaRole]
module.s3-website.aws_s3_bucket.static_site: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.iam-role-for-lambda.aws_iam_role_policy.cloudwatchlogs[0]: Refreshing state... [id=LambdaRole:cloudwatchlogs]
module.iam-role-for-lambda.aws_iam_role_policy.sns_and_ses[0]: Refreshing state... [id=LambdaRole:sns_and_ses]
module.s3-website.aws_s3_bucket_public_access_block.static_site_public_access_block: Refreshing state... [id=dubovsky-andrey-website-bucket]
module.s3-website.aws_s3_bucket_website_configuration.static_site_website: Refreshing state... [id=dubovsky-andrey-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3-website.aws_s3_bucket_policy.static_site_policy will be created
  + resource "aws_s3_bucket_policy" "static_site_policy" {
      + bucket = "dubovsky-andrey-website-bucket"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::dubovsky-andrey-website-bucket/*"
                      + Sid       = "PublicReadGetObject"
                    },
                  + {
                      + Action    = [
                          + "s3:PutBucketPolicy",
                          + "s3:GetBucketPolicy",
                          + "s3:DeleteBucketPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::dubovsky-andrey-website-bucket"
                      + Sid       = "BucketPolicyActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.s3-website.aws_s3_object.website_files["error.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = "public-read"
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/websiteerror.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["index.html"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = "public-read"
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/websiteindex.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["main.css"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = "public-read"
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "main.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/websitemain.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["serverless.js"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = "public-read"
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "serverless.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/websiteserverless.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3-website.aws_s3_object.website_files["whiskers.png"] will be created
  + resource "aws_s3_object" "website_files" {
      + acl                    = "public-read"
      + arn                    = (known after apply)
      + bucket                 = "dubovsky-andrey-website-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "whiskers.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./modules/s3-website/websitewhiskers.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "project" but a value was
found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "environment" but a value
was found in file "terraform.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dubovsky-Andrey, Action: `pull_request`*